// 3. Напишите программу вычисления функции:
//  x = f(a)

Console.Write("Введите число ");
string inputstring = Console.ReadLine();
int value = convert.ToInt32(inputstring);
int cube = value * value * value; 

System.Console.WriteLine(cobe);